#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function Athena_TheFarmstead_5x9_Barn_a_226.Athena_TheFarmstead_5x9_Barn_a_C.ReceiveBeginPlay
struct AAthena_TheFarmstead_5x9_Barn_a_C_ReceiveBeginPlay_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function Athena_TheFarmstead_5x9_Barn_a_226.Athena_TheFarmstead_5x9_Barn_a_C.BndEvt__SM_Farm_Wall_11_K2Node_ActorBoundEvent_37_ActorDestroyedSignature__DelegateSignature
struct AAthena_TheFarmstead_5x9_Barn_a_C_BndEvt__SM_Farm_Wall_11_K2Node_ActorBoundEvent_37_ActorDestroyedSignature__DelegateSignature_Params
{
public:
	class AActor*                                DestroyedActor;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function Athena_TheFarmstead_5x9_Barn_a_226.Athena_TheFarmstead_5x9_Barn_a_C.BndEvt__SM_Farm_Wall_8_K2Node_ActorBoundEvent_54_ActorDestroyedSignature__DelegateSignature
struct AAthena_TheFarmstead_5x9_Barn_a_C_BndEvt__SM_Farm_Wall_8_K2Node_ActorBoundEvent_54_ActorDestroyedSignature__DelegateSignature_Params
{
public:
	class AActor*                                DestroyedActor;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function Athena_TheFarmstead_5x9_Barn_a_226.Athena_TheFarmstead_5x9_Barn_a_C.BndEvt__SM_Farm_Wall_52_K2Node_ActorBoundEvent_88_ActorDestroyedSignature__DelegateSignature
struct AAthena_TheFarmstead_5x9_Barn_a_C_BndEvt__SM_Farm_Wall_52_K2Node_ActorBoundEvent_88_ActorDestroyedSignature__DelegateSignature_Params
{
public:
	class AActor*                                DestroyedActor;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function Athena_TheFarmstead_5x9_Barn_a_226.Athena_TheFarmstead_5x9_Barn_a_C.BndEvt__SM_Farm_Wall_29_K2Node_ActorBoundEvent_107_ActorDestroyedSignature__DelegateSignature
struct AAthena_TheFarmstead_5x9_Barn_a_C_BndEvt__SM_Farm_Wall_29_K2Node_ActorBoundEvent_107_ActorDestroyedSignature__DelegateSignature_Params
{
public:
	class AActor*                                DestroyedActor;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function Athena_TheFarmstead_5x9_Barn_a_226.Athena_TheFarmstead_5x9_Barn_a_C.BndEvt__SM_Farm_Wall_3_K2Node_ActorBoundEvent_1006_ActorDestroyedSignature__DelegateSignature
struct AAthena_TheFarmstead_5x9_Barn_a_C_BndEvt__SM_Farm_Wall_3_K2Node_ActorBoundEvent_1006_ActorDestroyedSignature__DelegateSignature_Params
{
public:
	class AActor*                                DestroyedActor;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function Athena_TheFarmstead_5x9_Barn_a_226.Athena_TheFarmstead_5x9_Barn_a_C.BndEvt__SM_Farm_Wall_24_K2Node_ActorBoundEvent_1027_ActorDestroyedSignature__DelegateSignature
struct AAthena_TheFarmstead_5x9_Barn_a_C_BndEvt__SM_Farm_Wall_24_K2Node_ActorBoundEvent_1027_ActorDestroyedSignature__DelegateSignature_Params
{
public:
	class AActor*                                DestroyedActor;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function Athena_TheFarmstead_5x9_Barn_a_226.Athena_TheFarmstead_5x9_Barn_a_C.BndEvt__SM_Farm_Wall_34_K2Node_ActorBoundEvent_1049_ActorDestroyedSignature__DelegateSignature
struct AAthena_TheFarmstead_5x9_Barn_a_C_BndEvt__SM_Farm_Wall_34_K2Node_ActorBoundEvent_1049_ActorDestroyedSignature__DelegateSignature_Params
{
public:
	class AActor*                                DestroyedActor;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x68 (0x68 - 0x0)
// Function Athena_TheFarmstead_5x9_Barn_a_226.Athena_TheFarmstead_5x9_Barn_a_C.ExecuteUbergraph_Athena_TheFarmstead_5x9_Barn_a
struct AAthena_TheFarmstead_5x9_Barn_a_C_ExecuteUbergraph_Athena_TheFarmstead_5x9_Barn_a_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3E92[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                K2Node_ActorBoundEvent_DestroyedActor;             // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Has_Been_Initd_Variable;                 // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_IsClosed_Variable;                       // 0x11(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3E93[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_ApplyDamage_ReturnValue;                  // 0x14(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_ApplyDamage_ReturnValue2;                 // 0x18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_ApplyDamage_ReturnValue3;                 // 0x1C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_ApplyDamage_ReturnValue4;                 // 0x20(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_ApplyDamage_ReturnValue5;                 // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_ApplyDamage_ReturnValue6;                 // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3E94[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                K2Node_ActorBoundEvent_DestroyedActor7;            // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                K2Node_ActorBoundEvent_DestroyedActor6;            // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                K2Node_ActorBoundEvent_DestroyedActor5;            // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                K2Node_ActorBoundEvent_DestroyedActor4;            // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                K2Node_ActorBoundEvent_DestroyedActor3;            // 0x50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_ApplyDamage_ReturnValue7;                 // 0x58(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3E95[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                K2Node_ActorBoundEvent_DestroyedActor2;            // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
