#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function B_FireCracker_Gun.B_FireCracker_Gun_C.UserConstructionScript
struct AB_FireCracker_Gun_C_UserConstructionScript_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function B_FireCracker_Gun.B_FireCracker_Gun_C.springVal__FinishedFunc
struct AB_FireCracker_Gun_C_SpringVal__FinishedFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function B_FireCracker_Gun.B_FireCracker_Gun_C.springVal__UpdateFunc
struct AB_FireCracker_Gun_C_SpringVal__UpdateFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function B_FireCracker_Gun.B_FireCracker_Gun_C.ReceiveBeginPlay
struct AB_FireCracker_Gun_C_ReceiveBeginPlay_Params
{
public:
};

// 0x2 (0x2 - 0x0)
// Function B_FireCracker_Gun.B_FireCracker_Gun_C.OnPlayWeaponFireFX
struct AB_FireCracker_Gun_C_OnPlayWeaponFireFX_Params
{
public:
	//bool                                       bPersistentFire;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	//bool                                       bSecondaryFire;                                    // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function B_FireCracker_Gun.B_FireCracker_Gun_C.OnWeaponAttached
struct AB_FireCracker_Gun_C_OnWeaponAttached_Params
{
public:
};

// 0x19 (0x19 - 0x0)
// Function B_FireCracker_Gun.B_FireCracker_Gun_C.ExecuteUbergraph_B_FireCracker_Gun
struct AB_FireCracker_Gun_C_ExecuteUbergraph_B_FireCracker_Gun_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Has_Been_Initd_Variable;                 // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_IsClosed_Variable;                       // 0x5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         K2Node_Event_bPersistentFire;                      // 0x6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         K2Node_Event_bSecondaryFire;                       // 0x7(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAnimInstance*                         CallFunc_GetAnimInstance_ReturnValue;              // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USK_FireCrackerGun_Skeleton_AnimBlueprint_C* K2Node_DynamicCast_AsSK_Fire_Cracker_Gun_Skeleton_Anim_Blueprint; // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
