#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function B_Pistol_Gatling_Athena.B_Pistol_Gatling_Athena_C.UserConstructionScript
struct AB_Pistol_Gatling_Athena_C_UserConstructionScript_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function B_Pistol_Gatling_Athena.B_Pistol_Gatling_Athena_C.Timeline_0_0__FinishedFunc
struct AB_Pistol_Gatling_Athena_C_Timeline_0_0__FinishedFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function B_Pistol_Gatling_Athena.B_Pistol_Gatling_Athena_C.Timeline_0_0__UpdateFunc
struct AB_Pistol_Gatling_Athena_C_Timeline_0_0__UpdateFunc_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function B_Pistol_Gatling_Athena.B_Pistol_Gatling_Athena_C.OnChargeDown
struct AB_Pistol_Gatling_Athena_C_OnChargeDown_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function B_Pistol_Gatling_Athena.B_Pistol_Gatling_Athena_C.OnChargeUp
struct AB_Pistol_Gatling_Athena_C_OnChargeUp_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function B_Pistol_Gatling_Athena.B_Pistol_Gatling_Athena_C.OnEndCharge
struct AB_Pistol_Gatling_Athena_C_OnEndCharge_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function B_Pistol_Gatling_Athena.B_Pistol_Gatling_Athena_C.OnStartCharge
struct AB_Pistol_Gatling_Athena_C_OnStartCharge_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function B_Pistol_Gatling_Athena.B_Pistol_Gatling_Athena_C.ReceiveTick
struct AB_Pistol_Gatling_Athena_C_ReceiveTick_Params
{
public:
	//float                                      DeltaSeconds;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function B_Pistol_Gatling_Athena.B_Pistol_Gatling_Athena_C.Reset_SpinDown_Sound
struct AB_Pistol_Gatling_Athena_C_Reset_SpinDown_Sound_Params
{
public:
};

// 0x1A (0x1A - 0x0)
// Function B_Pistol_Gatling_Athena.B_Pistol_Gatling_Athena_C.ExecuteUbergraph_B_Pistol_Gatling_Athena
struct AB_Pistol_Gatling_Athena_C_ExecuteUbergraph_B_Pistol_Gatling_Athena_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsReloading_ReturnValue;                  // 0x5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3BF8[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        K2Node_Event_DeltaSeconds;                         // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0xC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0xD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsReloading_ReturnValue2;                 // 0xE(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue2;                 // 0xF(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue2;                  // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3BF9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_GetMagazineAmmoCount_ReturnValue;         // 0x14(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Greater_IntInt_ReturnValue;               // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue3;                  // 0x19(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
