#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function BP_Monsoon_break_action_revolver.BP_Monsoon_break_action_revolver_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Monsoon_break_action_revolver_AnimGraphNode_ModifyBone_F54846DF4EA40510A42104985A5E8C6C
struct UBP_Monsoon_break_action_revolver_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Monsoon_break_action_revolver_AnimGraphNode_ModifyBone_F54846DF4EA40510A42104985A5E8C6C_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function BP_Monsoon_break_action_revolver.BP_Monsoon_break_action_revolver_C.BlueprintUpdateAnimation
struct UBP_Monsoon_break_action_revolver_C_BlueprintUpdateAnimation_Params
{
public:
	//float                                      DeltaTimeX;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x38 (0x38 - 0x0)
// Function BP_Monsoon_break_action_revolver.BP_Monsoon_break_action_revolver_C.ExecuteUbergraph_BP_Monsoon_break_action_revolver
struct UBP_Monsoon_break_action_revolver_C_ExecuteUbergraph_BP_Monsoon_break_action_revolver_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_Event_DeltaTimeX;                           // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CallFunc_MakeRotator_ReturnValue;                  // 0x8(0xC)(IsPlainOldData, NoDestructor)
	uint8                                        Pad_2DA9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                CallFunc_GetOwningActor_ReturnValue;               // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Pistol_Gatling_C*                   K2Node_DynamicCast_AsB_Pistol_Gatling;             // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2DAA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Add_FloatFloat_ReturnValue;               // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
