#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

namespace SDK
{
// 0x1EA (0x11CA - 0xFE0)
// BlueprintGeneratedClass BP_PlayerSpawnTeleportPad.BP_PlayerSpawnTeleportPAd_C
class ABP_PlayerSpawnTeleportPAd_C : public AFortPlayerSpawnPad
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xFE0(0x8)(Transient, DuplicateTransient)
	class USceneComponent*                       CameraTransformProxy;                              // 0xFE8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       LootChestCenter;                                   // 0xFF0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  S_Spawn_Flag_04;                                   // 0xFF8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  S_Spawn_Flag_03;                                   // 0x1000(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  S_Spawn_Flag_02;                                   // 0x1008(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  S_Spawn_Flag_01;                                   // 0x1010(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              Player4LevelUpPS;                                  // 0x1018(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              Player3LevelUpPS;                                  // 0x1020(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              Player2LevelUpPS;                                  // 0x1028(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              Player1LevelUpPS;                                  // 0x1030(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       Particles;                                         // 0x1038(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       Meshes;                                            // 0x1040(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                         DestructionVolume;                                 // 0x1048(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortMiniMapComponent*                 MiniMapComponent;                                  // 0x1050(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                               TimelineChestIntroNextChest_ChestOffset_304C0A2745903A202389F5AF878005F9; // 0x1058(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                TimelineChestIntroNextChest__Direction_304C0A2745903A202389F5AF878005F9; // 0x1064(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_31A0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    TimelineChestIntroNextChest;                       // 0x1068(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               TimelineChestCameraOutro_CameraOffset_8E02A974410FBFF2353688AE9ED16364; // 0x1070(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        TimelineChestCameraOutro_CameraPitchOffset_8E02A974410FBFF2353688AE9ED16364; // 0x107C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                TimelineChestCameraOutro__Direction_8E02A974410FBFF2353688AE9ED16364; // 0x1080(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_31A1[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    TimelineChestCameraOutro;                          // 0x1088(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               TimelineChestOutro_ChestOffset_A3EAB05745F93AAFC35AA2AF95754AEC; // 0x1090(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        TimelineChestOutro_Chest_whiteOut_A3EAB05745F93AAFC35AA2AF95754AEC; // 0x109C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                TimelineChestOutro__Direction_A3EAB05745F93AAFC35AA2AF95754AEC; // 0x10A0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_31A2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    TimelineChestOutro;                                // 0x10A8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               TimelineChestFinalFocus_CameraPositionOffset_B9B69D1340D82ED5791A47A2D08FEBFE; // 0x10B0(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        TimelineChestFinalFocus_PowerSwipeAnimation_B9B69D1340D82ED5791A47A2D08FEBFE; // 0x10BC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                TimelineChestFinalFocus__Direction_B9B69D1340D82ED5791A47A2D08FEBFE; // 0x10C0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_31A3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    TimelineChestFinalFocus;                           // 0x10C8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               TimelineChestProgression_ChestOffset_2B2DA749433D83B490167A80264D14B6; // 0x10D0(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               TimelineChestProgression_PrimaryChestOffset_2B2DA749433D83B490167A80264D14B6; // 0x10DC(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                TimelineChestProgression__Direction_2B2DA749433D83B490167A80264D14B6; // 0x10E8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_31A4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    TimelineChestProgression;                          // 0x10F0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               TimelineCameraIntro_CameraOffset_A3955BCE49F93B08E3315CBB5666B6D3; // 0x10F8(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                TimelineCameraIntro__Direction_A3955BCE49F93B08E3315CBB5666B6D3; // 0x1104(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_31A5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    TimelineCameraIntro;                               // 0x1108(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        TimelineChestCameraIntro_CameraPitchOffset_3D5354B34A15454450784C9E224D112F; // 0x1110(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                TimelineChestCameraIntro__Direction_3D5354B34A15454450784C9E224D112F; // 0x1114(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_31A6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    TimelineChestCameraIntro;                          // 0x1118(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        TimelineChestAddBadge_Chest_whiteOut_16FF6BDC4A45B7BC42521096E049C01B; // 0x1120(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        TimelineChestAddBadge_Chest_Squash_and_stretch_16FF6BDC4A45B7BC42521096E049C01B; // 0x1124(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                TimelineChestAddBadge__Direction_16FF6BDC4A45B7BC42521096E049C01B; // 0x1128(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_31A7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    TimelineChestAddBadge;                             // 0x1130(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                          Camera;                                            // 0x1138(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DroneHeight;                                       // 0x1140(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ExitDelay;                                         // 0x1144(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSpawnTeleportPadPlayerData>   PlayerData;                                        // 0x1148(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                        MaximumNumberOfPlayers;                            // 0x1158(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_31A8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                PlayerLogoutTimes;                                 // 0x1160(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                         bVictoryScreenStarted;                             // 0x1170(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_31A9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UStaticMesh*>                   ChestMeshes;                                       // 0x1178(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FVector                               ChestSpawnOffset;                                  // 0x1188(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CameraRelativeRotation;                            // 0x1194(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                               CameraRelativeLocation;                            // 0x11A0(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ChestIntroIndex;                                   // 0x11AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               ChestPosition;                                     // 0x11B0(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CurrentChestLevel;                                 // 0x11BC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            ChestDisplay;                                      // 0x11C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bInitializedCamera;                                // 0x11C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bSpawnedChests;                                    // 0x11C9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BP_PlayerSpawnTeleportPAd_C");
		return Clss;
	}

	void ChestSkipToResultFocusTimelineStops(bool CallFunc_IsPlaying_ReturnValue, bool CallFunc_IsPlaying_ReturnValue2, bool CallFunc_IsPlaying_ReturnValue3, bool CallFunc_IsPlaying_ReturnValue4, bool CallFunc_BooleanOR_ReturnValue);
