#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

namespace SDK
{
// 0x118 (0x11E8 - 0x10D0)
// BlueprintGeneratedClass ParentBuildingContainerBlueprint.ParentBuildingContainerBlueprint_C
class AParentBuildingContainerBlueprint_C : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x10D0(0x8)(Transient, DuplicateTransient)
	bool                                         DebugWind;                                         // 0x10D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2A51[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UMaterialInterface*>            IntenseWindMaterialsForPreview;                    // 0x10E0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UStaticMeshComponent*                  Wind_Intensity_Debug_Mesh;                         // 0x10F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>            OriginalMaterials;                                 // 0x10F8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInstanceDynamic*              Debug_TempMaterial;                                // 0x1108(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DebugWindYaw;                                      // 0x1110(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Debug_Wind_Intensity;                              // 0x1114(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Set_Max_Actor_Scale;                               // 0x1118(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2A52[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Max_Scale;                                         // 0x111C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULightComponent*>               TimeOfDayControlledLightsArray;                    // 0x1120(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                         Disable_TOD_Lights_and_Material_Emissive_Values;   // 0x1130(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active; // 0x1131(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Use_An_Alternate_Shadow_Mesh_When_The_Light_is_On_; // 0x1132(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2A53[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMesh*                           AlternateShadowStaticMesh;                         // 0x1138(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Animate_Emissive_and_Lights_Over_Time;             // 0x1140(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2A54[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FLinearColor>                  CodeControlled_EmissiveColor;                      // 0x1148(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                CodeControlled_LightConeOpacity;                   // 0x1158(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FDayPhaseFloats                       Light_Intensity_Over_Time_of_Day_;                 // 0x1168(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                        Day_Phase_Transition_Length;                       // 0x1178(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDayPhaseFloats                       Emissive_Intensity_Over_Time_of_Day;               // 0x117C(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                        Volumetric_Light_Scattering_Intensity;             // 0x118C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Cast_Volumetric_Shadows;                           // 0x1190(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Animate_Lights_With_A_Curve___Disables_time_of_day_light_controls; // 0x1191(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Animate_Mesh_MID_Emissive_Value_with_a_Curve___Disables_time_of_day_light_controls; // 0x1192(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2A55[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           LightAnimationCurve;                               // 0x1198(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CodeControlled_Animation_Curve_Animation_Length;   // 0x11A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A56[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                CodeControlled_Initial_Light_Intensity___used_in_conjunction_with_curve_based_value_animations; // 0x11A8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                        CodeControlled_NumberOfMaterials;                  // 0x11B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2A57[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                NewVar_0;                                          // 0x11C0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                       TimeOfDayControlledLightsPositionArray;            // 0x11D0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                        Random_Time_Scale_Percent;                         // 0x11E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CodeControlled_CurrentPlayLength;                  // 0x11E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ParentBuildingContainerBlueprint_C");
		return Clss;
	}

	void UserConstructionScript(bool CallFunc_IsDedicatedServer_ReturnValue, int32 Temp_int_Array_Index_Variable, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue, class UCurveLinearColor* CallFunc_GetWindSpeedCurveForPreview_ReturnValue, class UCurveLinearColor* CallFunc_GetWindPannerSpeedCurveForPreview_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FLinearColor& CallFunc_GetLinearColorValue_ReturnValue, float CallFunc_BreakColor_R, float CallFunc_BreakColor_G, float CallFunc_BreakColor_B, float CallFunc_BreakColor_A, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_RotateAngleAxis_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, const struct FLinearColor& CallFunc_GetLinearColorValue_ReturnValue2, const struct FLinearColor& CallFunc_MakeColor_ReturnValue, float CallFunc_BreakColor_R2, float CallFunc_BreakColor_G2, float CallFunc_BreakColor_B2, float CallFunc_BreakColor_A2, class UMaterialInterface* CallFunc_Array_Get_Item, TArray<class UMaterialInterface*>& CallFunc_GetIntenseWindMaterialsForPreview_Materials, bool CallFunc_GetIntenseWindMaterialsForPreview_ReturnValue, class UMaterialInstance* K2Node_DynamicCast_AsMaterial_Instance, bool K2Node_DynamicCast_bSuccess, int32 Temp_int_Array_Index_Variable2, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue2, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable2, class UCurveLinearColor* CallFunc_GetWindSpeedCurveForPreview_ReturnValue2, bool CallFunc_IsValid_ReturnValue2, int32 CallFunc_Add_IntInt_ReturnValue2, class UCurveLinearColor* CallFunc_GetWindPannerSpeedCurveForPreview_ReturnValue2, const class FString& CallFunc_GetDisplayName_ReturnValue, bool CallFunc_IsValid_ReturnValue3, bool CallFunc_IsValid_ReturnValue4, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue2, bool CallFunc_EqualEqual_IntInt_ReturnValue, TArray<class UMaterialInterface*>& CallFunc_GetMaterials_ReturnValue, bool CallFunc_SetStaticMesh_ReturnValue, const struct FVector& CallFunc_GetActorScale3D_ReturnValue, float CallFunc_BreakVector_X2, float CallFunc_BreakVector_Y2, float CallFunc_BreakVector_Z2, float CallFunc_FMax_ReturnValue, const struct FTransform& Temp_struct_Variable, float CallFunc_FMax_ReturnValue2, const struct FVector& CallFunc_Divide_VectorFloat_ReturnValue, class UStaticMeshComponent* CallFunc_AddComponent_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_IsValid_ReturnValue5, bool CallFunc_BooleanOR_ReturnValue, float CallFunc_GetTimeRange_MinTime, float CallFunc_GetTimeRange_MaxTime, bool CallFunc_Not_PreBool_ReturnValue, class ULightComponent* CallFunc_Array_Get_Item2, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_IsValid_ReturnValue6, int32 CallFunc_Array_Length_ReturnValue3, int32 CallFunc_Array_Length_ReturnValue4, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue2, bool CallFunc_Not_PreBool_ReturnValue3, bool CallFunc_BooleanAND_ReturnValue2, bool CallFunc_Not_PreBool_ReturnValue4, class UMaterialInterface* CallFunc_Array_Get_Item3, class UMaterialInstance* K2Node_DynamicCast_AsMaterial_Instance2, bool K2Node_DynamicCast_bSuccess2, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, int32 CallFunc_Array_Length_ReturnValue5, bool CallFunc_Less_IntInt_ReturnValue2);
	void ReceiveBeginPlay();
	void OnDayPhaseChanged(enum class EFortDayPhase CurrentDayPhase, enum class EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void OnSetSearched();
	void Loop_Animation_Curve();
	void OnBounceAnimationUpdate(const struct FFortBounceData& Data);
	void ExecuteUbergraph_ParentBuildingContainerBlueprint(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 Temp_int_Variable, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetAnimatingMID_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, float Temp_float_Variable, class AFortTimeOfDayManager* CallFunc_GetTimeOfDayManagerFromContext_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue2, int32 Temp_int_Array_Index_Variable2, enum class EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue, enum class EFortDayPhase Temp_byte_Variable, int32 Temp_int_Loop_Counter_Variable2, float Temp_float_Variable2, int32 CallFunc_Add_IntInt_ReturnValue3, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue, enum class EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue, int32 CallFunc_GetNumMaterials_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 Temp_int_Variable2, int32 Temp_int_Variable3, class UMaterialInstanceDynamic* CallFunc_GetAnimatingMID_ReturnValue2, class UMaterialInstanceDynamic* CallFunc_GetAnimatingMID_ReturnValue3, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue4, int32 CallFunc_Add_IntInt_ReturnValue5, enum class EFortDayPhase Temp_byte_Variable2, class AFortTimeOfDayManager* CallFunc_GetTimeOfDayManagerFromContext_ReturnValue2, enum class EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue2, bool CallFunc_IsValid_ReturnValue2, enum class EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue2, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue2, int32 Temp_int_Array_Index_Variable3, int32 CallFunc_GetNumMaterials_ReturnValue2, int32 CallFunc_Subtract_IntInt_ReturnValue2, bool CallFunc_LessEqual_IntInt_ReturnValue2, int32 Temp_int_Loop_Counter_Variable3, int32 CallFunc_Add_IntInt_ReturnValue6, enum class EFortDayPhase Temp_byte_Variable3, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue3, int32 CallFunc_GetNumMaterials_ReturnValue3, int32 CallFunc_Subtract_IntInt_ReturnValue3, enum class EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue3, int32 Temp_int_Array_Index_Variable4, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue4, int32 CallFunc_GetNumMaterials_ReturnValue4, int32 Temp_int_Array_Index_Variable5, int32 CallFunc_Subtract_IntInt_ReturnValue4, enum class EFortDayPhase Temp_byte_Variable4, int32 Temp_int_Loop_Counter_Variable4, enum class EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue4, int32 CallFunc_Add_IntInt_ReturnValue7, enum class EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue3, int32 Temp_int_Variable4, enum class EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue5, class UMaterialInstanceDynamic* CallFunc_GetAnimatingMID_ReturnValue4, int32 CallFunc_Add_IntInt_ReturnValue8, enum class EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue4, class AFortTimeOfDayManager* CallFunc_GetTimeOfDayManagerFromContext_ReturnValue3, enum class EFortDayPhase Temp_byte_Variable5, bool CallFunc_IsValid_ReturnValue3, float Temp_float_Variable3, float Temp_float_Variable4, int32 Temp_int_Variable5, class AFortTimeOfDayManager* CallFunc_GetTimeOfDayManagerFromContext_ReturnValue4, class UMaterialInstanceDynamic* CallFunc_GetAnimatingMID_ReturnValue5, bool CallFunc_IsValid_ReturnValue4, int32 CallFunc_Add_IntInt_ReturnValue9, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue5, int32 CallFunc_GetNumMaterials_ReturnValue5, int32 CallFunc_Subtract_IntInt_ReturnValue5, enum class EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue5, bool CallFunc_LessEqual_IntInt_ReturnValue3, int32 Temp_int_Array_Index_Variable6, enum class EFortDayPhase Temp_byte_Variable6, float Temp_float_Variable5, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue2, enum class EFortDayPhase Temp_byte_Variable7, class AFortTimeOfDayManager* CallFunc_GetTimeOfDayManagerFromContext_ReturnValue5, bool CallFunc_IsValid_ReturnValue5, bool CallFunc_IsDedicatedServer_ReturnValue3, enum class EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue6, int32 Temp_int_Array_Index_Variable7, enum class EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue6, int32 Temp_int_Loop_Counter_Variable5, class AFortTimeOfDayManager* CallFunc_GetTimeOfDayManagerFromContext_ReturnValue6, bool CallFunc_IsValid_ReturnValue6, int32 CallFunc_Add_IntInt_ReturnValue10, float Temp_float_Variable6, float Temp_float_Variable7, enum class EFortDayPhase Temp_byte_Variable8, float CallFunc_RandomFloatInRange_ReturnValue, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue6, int32 Temp_int_Variable6, int32 CallFunc_GetNumMaterials_ReturnValue6, class UMaterialInstanceDynamic* CallFunc_GetAnimatingMID_ReturnValue6, int32 CallFunc_Subtract_IntInt_ReturnValue6, bool CallFunc_LessEqual_IntInt_ReturnValue4, bool CallFunc_LessEqual_IntInt_ReturnValue5, int32 CallFunc_Add_IntInt_ReturnValue11, int32 Temp_int_Array_Index_Variable8, float CallFunc_RandomFloatInRange_ReturnValue2, int32 Temp_int_Loop_Counter_Variable6, int32 CallFunc_Add_IntInt_ReturnValue12, enum class EFortDayPhase Temp_byte_Variable9, class AFortTimeOfDayManager* CallFunc_GetTimeOfDayManagerFromContext_ReturnValue7, bool CallFunc_IsValid_ReturnValue7, enum class EFortDayPhase Temp_byte_Variable10, float CallFunc_GetScalarParameterValue_ReturnValue, enum class EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue7, int32 Temp_int_Loop_Counter_Variable7, int32 Temp_int_Variable7, class UMaterialInstanceDynamic* CallFunc_GetAnimatingMID_ReturnValue7, float CallFunc_K2_GetScalarParameterValue_ReturnValue, const struct FLinearColor& CallFunc_K2_GetVectorParameterValue_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue6, int32 CallFunc_Add_IntInt_ReturnValue13, int32 CallFunc_Add_IntInt_ReturnValue14, int32 Temp_int_Loop_Counter_Variable8, int32 Temp_int_Loop_Counter_Variable9, int32 CallFunc_Add_IntInt_ReturnValue15, int32 CallFunc_Add_IntInt_ReturnValue16, int32 Temp_int_Array_Index_Variable9, enum class EFortDayPhase Temp_byte_Variable11, class ULightComponent* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class ULightComponent* CallFunc_Array_Get_Item2, int32 CallFunc_Array_Length_ReturnValue2, bool CallFunc_Less_IntInt_ReturnValue2, enum class EFortDayPhase K2Node_Event_CurrentDayPhase, enum class EFortDayPhase K2Node_Event_PreviousDayPhase, bool K2Node_Event_bAtCreation, class ULightComponent* CallFunc_Array_Get_Item3, float K2Node_Select_Default, float K2Node_Select2_Default, int32 CallFunc_Array_Length_ReturnValue3, bool CallFunc_Less_IntInt_ReturnValue3, float CallFunc_Array_Get_Item4, float CallFunc_Multiply_FloatFloat_ReturnValue, float K2Node_Select3_Default, float K2Node_Select4_Default, float CallFunc_Multiply_FloatFloat_ReturnValue2, float CallFunc_Lerp_ReturnValue, float K2Node_Select5_Default, float K2Node_Select6_Default, float CallFunc_Lerp_ReturnValue2, const struct FLinearColor& CallFunc_Array_Get_Item5, float CallFunc_Array_Get_Item6, const struct FLinearColor& CallFunc_Multiply_LinearColorFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue3, float CallFunc_Multiply_FloatFloat_ReturnValue4, const struct FLinearColor& CallFunc_Multiply_LinearColorFloat_ReturnValue2, float CallFunc_Array_Get_Item7, int32 CallFunc_Array_Add_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue5, const struct FLinearColor& CallFunc_Array_Get_Item8, const struct FLinearColor& CallFunc_Multiply_LinearColorFloat_ReturnValue3, int32 CallFunc_Array_Add_ReturnValue2, int32 CallFunc_Array_Length_ReturnValue4, bool CallFunc_EqualEqual_IntInt_ReturnValue, class ULightComponent* CallFunc_Array_Get_Item9, int32 CallFunc_Array_Length_ReturnValue5, bool CallFunc_Less_IntInt_ReturnValue4, float K2Node_Select7_Default, float K2Node_Select8_Default, float K2Node_Select9_Default, float K2Node_Select10_Default, float K2Node_Select11_Default, float CallFunc_Lerp_ReturnValue3, float CallFunc_Lerp_ReturnValue4, enum class EFortDayPhase Temp_byte_Variable12, float K2Node_Select12_Default, const struct FLinearColor& CallFunc_Array_Get_Item10, const struct FLinearColor& CallFunc_Multiply_LinearColorFloat_ReturnValue4, const struct FLinearColor& CallFunc_Multiply_LinearColorFloat_ReturnValue5, class ULightComponent* CallFunc_Array_Get_Item11, int32 CallFunc_Array_Length_ReturnValue6, bool CallFunc_Less_IntInt_ReturnValue5, class ULightComponent* CallFunc_Array_Get_Item12, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsValid_ReturnValue8, bool CallFunc_Not_PreBool_ReturnValue2, bool CallFunc_Not_PreBool_ReturnValue3, int32 CallFunc_Array_Length_ReturnValue7, int32 CallFunc_Array_Length_ReturnValue8, bool CallFunc_Less_IntInt_ReturnValue6, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue4, bool CallFunc_BooleanAND_ReturnValue2, bool CallFunc_BooleanOR_ReturnValue, class ULightComponent* CallFunc_Array_Get_Item13, int32 CallFunc_Array_Length_ReturnValue9, bool CallFunc_IsValid_ReturnValue9, bool CallFunc_Less_IntInt_ReturnValue7, float CallFunc_Array_Get_Item14, int32 CallFunc_Subtract_IntInt_ReturnValue7, bool CallFunc_LessEqual_IntInt_ReturnValue7, bool CallFunc_BooleanOR_ReturnValue2, enum class EFortDayPhase Temp_byte_Variable13, bool CallFunc_BooleanAND_ReturnValue3, float K2Node_Select13_Default, float CallFunc_Lerp_ReturnValue5, class ULightComponent* CallFunc_Array_Get_Item15, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, int32 CallFunc_Array_Add_ReturnValue3, int32 CallFunc_Array_Add_ReturnValue4, bool CallFunc_IsValid_ReturnValue10, int32 CallFunc_Array_Length_ReturnValue10, bool CallFunc_Less_IntInt_ReturnValue8, const struct FFortBounceData& K2Node_Event_Data, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class ULightComponent* CallFunc_Array_Get_Item16, float CallFunc_BreakColor_R, float CallFunc_BreakColor_G, float CallFunc_BreakColor_B, float CallFunc_BreakColor_A, float CallFunc_BreakColor_R2, float CallFunc_BreakColor_G2, float CallFunc_BreakColor_B2, float CallFunc_BreakColor_A2, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue2, const struct FVector& CallFunc_Array_Get_Item17, float CallFunc_Multiply_FloatFloat_ReturnValue6, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_VSize_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue7, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_FClamp_ReturnValue, int32 CallFunc_Array_Length_ReturnValue11, float CallFunc_Subtract_FloatFloat_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue9, float CallFunc_SelectFloat_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue2, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue3, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
